class101/artillery-script/io-test.yaml
#io-10k-test1
config:
  target: "http://34.80.231.65/"
  phases:
    - duration: 60
      arrivalRate: 3
      name: Warm up
    - duration: 120
      arrivalRate: 3
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "ratings_test_10k.csv"
    fields:
      - "content"
scenarios:
  - name: "just post content"
    flow:
      - post:
          url: "/post"
          json:
            content: "{{ content }}"
      - think: 1
      - get:
          url: "/posts"
# io-10k-test1
# config:
#   target: "http://34.80.231.65/"
#   phases:
#     - duration: 60
#       arrivalRate: 3
#       name: Warm up
#     - duration: 120
#       arrivalRate: 3
#       rampTo: 100
#       name: Ramp up load
#     - duration: 600
#       arrivalRate: 100
#       name: Sustained load
#   payload:
#     path: "ratings_test_10k.csv"
#     fields:
#       - "content"
# scenarios:
#   - name: "just post content"
#     flow:
#       - post:
#           url: "/post"
#           json:
#             content: "{{ content }}"
# config:
#   target: "http://34.80.231.65/"
#   phases:
#     - duration: 333
#       arrivalRate: 3
#       name: Warm up
#   payload:
#     path: "ratings_test_1k.csv"
#     fields:
#       - "content"

# scenarios:
#   - name: "just post content"
#     flow:
#       - post:
#           url: "/post"
#           json:
#             content: "{{ content }}"